public class Main {
    public static void main(String[] args) {

        // Курсовой проект

        // Часть 1

        System.out.println("Hello world!");



        // Задача на функциональное программирование



    }
}