public class Main {
    public static void main(String[] args) {

        // Билет 7

        // Когда применяется цикл while?
        // Для чего применяется метод toString?
        // Что такое область видимости?

        // Задание 1

        // Напишите метод, который возводит число в квадрат.

        System.out.println("Hello world!");

    }
}